package org.chaoswarlock.sprint4.test_data;

public class TestOrderFlowData {
    ///Структура вводных данных Имя Фамилия Адрес Компания Телефон + Дата заказа  Количество суток на аренду Коммент курьеру Цвет тоже можно было задать но не задал.
    public static String[][][] inputData2 = {
            {{"Петр", "Сидоров", "г. Санкт-Петербург, ул. Московский проспект, д. 3", "Чистые пруды", "79407705217"}, {"20.02.2021", "сутки", "Москва город"}},
            {{"Алексей", "Иванов", "г. Москва, ул. Тверская, д. 10", "Бульвар Рокоссовского", "79407705217"}, {"15.06.2019", "двое суток", "Россия великая"}},
            {{"Дмитрий", "Петров", "г. Нижний Новгород, ул. Большая Покровская, д. 5", "Черкизовская", "79508806421"}, {"28.08.2022", "трое суток", "Новгород старый"}},
            {{"Сергей", "Сергеев", "г. Екатеринбург, ул. Ленина, д. 20", "Преображенская площадь", "79508806421"}, {"12.04.2020", "четверо суток", "Урал горы"}},
            {{"Андрей", "Андреев", "г. Новосибирск, ул. Красный проспект, д. 15", "Сокольники", "79508806421"}, {"25.09.2021", "трое суток", "Сибирь леса"}},
            {{"Владимир", "Владимиров", "г. Казань, ул. Баумана, д. 8", "Красносельская", "79508806421"}, {"18.03.2018", "четверо суток", "Казань город"}},
            {{"Михаил", "Михайлов", "г. Ростов-на-Дону, ул. Большая Садовая, д. 12", "Комсомольская", "79508806421"}, {"22.11.2020", "сутки", "Дон реки"}},
            {{"Николай", "Николаев", "г. Красноярск, ул. Ленина, д. 25", "Красные Ворота", "79508806421"}, {"16.07.2019", "двое суток", "Красноярск город"}},
            {{"Иван", "Иванов", "г. Пермь, ул. Ленина, д. 30", "Лубянка", "79508806421"}, {"10.10.2022", "сутки", "Пермь край"}}
    };
}
